# vsoStateGetExitGroup

## Description
```pascal
FUNCTION vsoStateGetExitGroup(
				hObj           : HANDLE;
				VAR outGrpType : LONGINT) : BOOLEAN;
```

```python

def vs.vsoStateGetExitGroup(hObj):
    return (BOOLEAN, outGrpType)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outGrpType|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events